Рабочая.Задачи2/src/Documents/ЦБР_Задание/ЦБР_Задание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЦБР_Задание</name>
  <registerRecords>AccumulationRegister.ЦБР_ЧасыКлиентов</registerRecords>
  <registerRecords>AccumulationRegister.ЦБР_СогласованоЗакрытоЧасов</registerRecords>
  <registerRecords>AccumulationRegister.ЦБР_КоличествоЧасовСотрудниковПоЗадачам</registerRecords>
  <attributes>
    <name>Аналитик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЧаса</name>
    <type>
      <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалоПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалоФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончаниеПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончаниеФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьДниПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьДниФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПереписка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПрикрепленныйФайл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаСчетКомпании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоментарийКСогласованию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьСроки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НетГарантииОценки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаданияВУровне</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДополнительное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаПоФакту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущееЗадание</name>
    <type>
      <types>DocumentRef.ЦБР_Задание</types>
    </type>
  </attributes>
  <attributes>
    <name>Принято</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Разделена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РамочнаяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Родитель</name>
    <type>
      <types>CatalogRef.ЦБР_СтруктураЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаЗадачу</name>
    <type>
      <types>CatalogRef.ЦБР_Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаСтруктуру</name>
    <type>
      <types>CatalogRef.ЦБР_СтруктураЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОценкиЗадачи</name>
    <type>
      <types>EnumRef.ЦБР_ТипОценкиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалосьРешитьПриПодключении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасыСогласованы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоУточнениеТребований</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланСтарый</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Предшественники</name>
    <attributes>
      <name>Предшественник</name>
      <type>
        <types>DocumentRef.ЦБР_Задание</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗависимости</name>
      <type>
        <types>EnumRef.ЦБР_ТипЗависимостиЗаданий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭффективныеЧасы</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЧаса</name>
      <type>
        <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭффективныеЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействиеКалендаря</name>
      <type>
        <types>CatalogRef.ЦБР_ЗаписиРабочегоКалендаря</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧасыЗП</name>
    <attributes>
      <name>ПериодЗП</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭффективныеЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЧаса</name>
      <type>
        <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.cbr_РеализацияТоваровУслугУПР</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаСчетКомпании</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Зачтено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Рабочая.Задачи2/src/AccumulationRegisters/ЦБР_ЧасыКлиентов/ЦБР_ЧасыКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЦБР_ЧасыКлиентов</name>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Акт</name>
    <type>
      <types>DocumentRef.cbr_РеализацияТоваровУслугУПР</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЧаса</name>
    <type>
      <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Рабочая.Задачи2/src/AccumulationRegisters/ЦБР_СогласованоЗакрытоЧасов/ЦБР_СогласованоЗакрытоЧасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЦБР_СогласованоЗакрытоЧасов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Закрыто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Выполнено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатусЗадачиБезРеализации</name>
    <type>
      <types>EnumRef.ЦБР_СтатусыЗадачиБезРеализации</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПодразделениеИсполнителя</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеПостановщика</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ЦБР_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЧаса</name>
    <type>
      <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.cbr_РеализацияТоваровУслугУПР</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Рабочая.Задачи2/src/AccumulationRegisters/ЦБР_КоличествоЧасовСотрудниковПоЗадачам/ЦБР_КоличествоЧасовСотрудниковПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЦБР_КоличествоЧасовСотрудниковПоЗадачам</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ЦБР_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DocumentRef.ЦБР_Задание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЧаса</name>
    <type>
      <types>EnumRef.ЦБР_ВидыЧасовПоЗадачам</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Рабочая.Задачи2/src/InformationRegisters/ЦБР_ЗанятостьПоДням/ЦБР_ЗанятостьПоДням.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦБР_ЗанятостьПоДням</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПостановщика</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнителя</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DocumentRef.ЦБР_Задание</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Рабочая.Задачи2/src/Enums/ЦБР_ТипОценкиЗадачи/ЦБР_ТипОценкиЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_ТипОценкиЗадачи</name>
  <enumValues>
    <name>ПоФакту</name>
  </enumValues>
  <enumValues>
    <name>Предсогласованные</name>
  </enumValues>
  <enumValues>
    <name>Стандартная</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/Documents/ЦБР_Задание/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	ТрудозатратыФакт = ЭффективныеЧасы.Итог("ЭффективныеЧасы");
	
	Если ТипОценкиЗадачи = ПредопределенноеЗначение("Перечисление.ЦБР_ТипОценкиЗадачи.ПоФакту") Тогда
		ТрудозатратыПлан = ТрудозатратыФакт;
	КонецЕсли; 
	
	Если ВидЧаса = ПредопределенноеЗначение("Перечисление.ЦБР_ВидыЧасовПоЗадачам.ПустаяСсылка") Тогда
		ВидЧаса = ПредопределенноеЗначение("Перечисление.ЦБР_ВидыЧасовПоЗадачам.Платные")
	КонецЕсли; 
	
	Для Каждого Стр Из ЭффективныеЧасы Цикл  
		Если Стр.ВидЧаса = Перечисления.ЦБР_ВидыЧасовПоЗадачам.ПустаяСсылка() Тогда
			Стр.ВидЧаса = Перечисления.ЦБР_ВидыЧасовПоЗадачам.Платные;
		КонецЕсли;  
	КонецЦикла;	
	
	Если ТрудозатратыФакт > 0 И ЧасыЗП.Количество() = 0 Тогда
		
		ТЗЧасов = ЭффективныеЧасы.Выгрузить();
		ТЗЧасов.Колонки.Добавить("ПериодЗП", Новый ОписаниеТипов("Дата"));
		Для Каждого Стр Из ТЗЧасов Цикл 
			Стр.ПериодЗП = НачалоМесяца(Стр.Дата);
		КонецЦикла;	
		
		ТЗЧасов.Свернуть("ПериодЗП,Исполнитель,ВидЧаса", "ЭффективныеЧасы");  
		ЧасыЗП.Загрузить(ТЗЧасов);
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(СсылкаНаСтруктуру) Тогда   				
		спрЦБР_СтруктураЗадач = Справочники.ЦБР_СтруктураЗадач.СоздатьЭлемент();
		спрЦБР_СтруктураЗадач.Владелец = СсылкаНаЗадачу;
		ЗаполнитьЗначенияСвойств(спрЦБР_СтруктураЗадач, ЭтотОбъект);
		спрЦБР_СтруктураЗадач.Записать();
		
		СсылкаНаСтруктуру = спрЦБР_СтруктураЗадач.Ссылка;
		НомерЗаданияВУровне = спрЦБР_СтруктураЗадач.НомерЗаданияВУровне;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаНаЗадачу) Тогда
		
		РеквизитыЗадачи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаЗадачу, "ТипОценкиЗадачи,Постановщик"); 
		
		ТипОценкиЗадачи = РеквизитыЗадачи.ТипОценкиЗадачи;
		
		Если Не ЗначениеЗаполнено(Постановщик) Тогда
			Постановщик = РеквизитыЗадачи.Постановщик;
		КонецЕсли;
	 
	КонецЕсли; 
	
	Если ТипОценкиЗадачи = Перечисления.ЦБР_ТипОценкиЗадачи.ПоФакту Тогда
		ОплатаПоФакту = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		 Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Исполнитель, "Подразделение"); 
	КонецЕсли;	
	
	Если РамочнаяОценка Тогда
		ТрудозатратыПланПредставление = СтрШаблон("%1 - %2", ТрудозатратыПланОт, ТрудозатратыПланДо);  
	ИначеЕсли ОплатаПоФакту Тогда
		ТрудозатратыПланПредставление = "по факту";
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ЦБР_ОбсужденияСервер.ПроверитьСоздатьОбщееОбсуждение(Ссылка);
	
	ЗаписатьДанныеЗанятостьПоДням();
	ПроверитьЗаполнитьСтруктуру();
		
	ТекущееСостояние = ЦБР_СтатусыОбъектовПолныеПрава.ПолучитьАктуальныйСтатусЗадания(Ссылка);
	ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусЗадания(Ссылка, ТекущееСостояние);	
	
	Если ЗначениеЗаполнено(ПредыдущееЗадание) Тогда
		ТекущееСостояниеПредыдущегоЗадания = ЦБР_СтатусыОбъектовПолныеПрава.ПолучитьАктуальныйСтатусЗадания(ПредыдущееЗадание);
		
		Если ТекущееСостояниеПредыдущегоЗадания = Перечисления.ЦБР_Состояние.Новый Тогда 
			ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусЗадания(Ссылка, Перечисления.ЦБР_Состояние.Запланировано);	
		КонецЕсли;   
	КонецЕсли;	
	
	ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусыЗадачи(СсылкаНаЗадачу);
	//ЗакрытьЗапланированныеСобытияВКалендаре();
			
КонецПроцедуры
	
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 

	Запрос = Новый Запрос(); 
	
	Движения.ЦБР_ЧасыКлиентов.Записывать = Истина;   
	Запрос.Текст = ТекстЗапроса_центрЧасыКлиентов();
	Запрос.Параметры.Вставить("Ссылка", Ссылка);  
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаРезультатаЗапроса = РезультатЗапроса.Выбрать();
	
    Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
        Движение = Движения.ЦБР_ЧасыКлиентов.Добавить();
        Движение.ВидДвижения 	= ВыборкаРезультатаЗапроса.ВидДвижения;  
        Движение.Регистратор 	= ВыборкаРезультатаЗапроса.Регистратор;  
        Движение.Период 		= ВыборкаРезультатаЗапроса.Период;
        Движение.Акт 			= ВыборкаРезультатаЗапроса.Акт;
        Движение.Контрагент 	= ВыборкаРезультатаЗапроса.Контрагент;
        Движение.Менеджер 		= ВыборкаРезультатаЗапроса.Менеджер;
        Движение.ВидЧаса 		= ВыборкаРезультатаЗапроса.ВидЧаса;
        Движение.Часы 			= ВыборкаРезультатаЗапроса.Часы;
	КонецЦикла;
	
	Движения.ЦБР_СогласованоЗакрытоЧасов.Записывать = Истина;   
	Запрос.Текст = ТекстЗапросаЦБР_СогласованоЗакрытоЧасов();
	Запрос.Параметры.Вставить("Ссылка", Ссылка);  
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаРезультатаЗапроса = РезультатЗапроса.Выбрать();
	
    Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
        Движение = Движения.ЦБР_СогласованоЗакрытоЧасов.Добавить();
        Движение.Регистратор 				= ВыборкаРезультатаЗапроса.Регистратор;  
        Движение.Период 					= ВыборкаРезультатаЗапроса.Период;
        Движение.ПодразделениеИсполнителя 	= ВыборкаРезультатаЗапроса.ПодразделениеИсполнителя;
        Движение.ПодразделениеПостановщика 	= ВыборкаРезультатаЗапроса.ПодразделениеПостановщика;
        Движение.Задача 					= ВыборкаРезультатаЗапроса.Задача;
        Движение.Исполнитель 				= ВыборкаРезультатаЗапроса.Исполнитель;
        Движение.Постановщик 				= ВыборкаРезультатаЗапроса.Постановщик; 
        Движение.ВидЧаса 					= ВыборкаРезультатаЗапроса.ВидЧаса;
        Движение.Реализация 				= ВыборкаРезультатаЗапроса.Реализация; 
        Движение.СтатусЗадачиБезРеализации  = ВыборкаРезультатаЗапроса.СтатусЗадачиБезРеализации; 
        Движение.Согласовано 				= ВыборкаРезультатаЗапроса.Согласовано; 
        Движение.Закрыто 					= ВыборкаРезультатаЗапроса.Закрыто;  
        Движение.Выполнено 					= ВыборкаРезультатаЗапроса.Выполнено;  
	КонецЦикла;
	
	Движения.ЦБР_КоличествоЧасовСотрудниковПоЗадачам.Записывать = Истина; 
	Движения._центрРезультатыПоказателей.Записывать = Истина;   

	Запрос.Текст = ТекстЗапроса_ЦБР_КоличествоЧасовСотрудниковПоЗадачам();
	Запрос.Параметры.Вставить("Ссылка", Ссылка);  
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаРезультатаЗапроса = РезультатЗапроса.Выбрать();
	
    Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
        Движение = Движения.ЦБР_КоличествоЧасовСотрудниковПоЗадачам.Добавить();
        Движение.Регистратор 				= ВыборкаРезультатаЗапроса.Регистратор;  
        Движение.Период 					= ВыборкаРезультатаЗапроса.Период;
        Движение.Задача 					= ВыборкаРезультатаЗапроса.СсылкаНаЗадачу;     
        Движение.Задание 					= ВыборкаРезультатаЗапроса.Регистратор;
        Движение.Исполнитель 				= ВыборкаРезультатаЗапроса.Исполнитель;
        Движение.ТипЧаса 					= ВыборкаРезультатаЗапроса.ВидЧаса;
        Движение.Часы 						= ВыборкаРезультатаЗапроса.Часы;  
		
        ДвижениеKPI = Движения._центрРезультатыПоказателей.Добавить();
        ДвижениеKPI.Регистратор 			= ВыборкаРезультатаЗапроса.Регистратор;  
        ДвижениеKPI.Период 					= ВыборкаРезультатаЗапроса.Период;
        ДвижениеKPI.Подразделение 			= ВыборкаРезультатаЗапроса.Исполнитель.Подразделение;     
        ДвижениеKPI.Пользователь 			= ВыборкаРезультатаЗапроса.Исполнитель;
        ДвижениеKPI.Показатель 				= Справочники._центрПоказатели.ЭффективныеЧасы;
        ДвижениеKPI.ЗначениеПоказателя 		= ВыборкаРезультатаЗапроса.Часы;
		ДвижениеKPI.ВидПлана 				= Перечисления.ЦБР_ВидПлана.Год;  
		
        ДвижениеKPI = Движения._центрРезультатыПоказателей.Добавить();
        ДвижениеKPI.Регистратор 			= ВыборкаРезультатаЗапроса.Регистратор;  
        ДвижениеKPI.Период 					= ВыборкаРезультатаЗапроса.Период;
        ДвижениеKPI.Подразделение 			= ВыборкаРезультатаЗапроса.Исполнитель.Подразделение;     
        ДвижениеKPI.Пользователь 			= ВыборкаРезультатаЗапроса.Исполнитель;
        ДвижениеKPI.Показатель 				= Справочники._центрПоказатели.ЭффективныеЧасы;
        ДвижениеKPI.ЗначениеПоказателя 		= ВыборкаРезультатаЗапроса.Часы;
		ДвижениеKPI.ВидПлана 				= Перечисления.ЦБР_ВидПлана.Месяц;
		
		ДвижениеKPI = Движения._центрРезультатыПоказателей.Добавить();
        ДвижениеKPI.Регистратор 			= ВыборкаРезультатаЗапроса.Регистратор;  
        ДвижениеKPI.Период 					= ВыборкаРезультатаЗапроса.Период;
        ДвижениеKPI.Подразделение 			= ВыборкаРезультатаЗапроса.Исполнитель.Подразделение;     
        ДвижениеKPI.Пользователь 			= ВыборкаРезультатаЗапроса.Исполнитель;
        ДвижениеKPI.Показатель 				= Справочники._центрПоказатели.ЭффективныеЧасы;
        ДвижениеKPI.ЗначениеПоказателя 		= ВыборкаРезультатаЗапроса.Часы;
		ДвижениеKPI.ВидПлана 				= Перечисления.ЦБР_ВидПлана.Индивидуальный;
	КонецЦикла;
	
	ЦБР_ЗадачиЗаданияВызовСервера.ДобавитьПредсогласованныеЧасы(ЭтотОбъект, СсылкаНаЗадачу);
	
КонецПроцедуры

Функция ТекстЗапроса_центрЧасыКлиентов()

	ТекстЗапроса =	"ВЫБРАТЬ
	              	|	ЦБР_ЗаданиеЭффективныеЧасы.ПериодЗП КАК Период,
	              	|	ЦБР_Задание.Ссылка КАК Регистратор,
	              	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	              	|	РеализацияТоваровУслуг.Ссылка КАК Акт,
	              	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	              	|	РеализацияТоваровУслуг.Менеджер КАК Менеджер,
	              	|	ЦБР_ЗаданиеЭффективныеЧасы.ВидЧаса КАК ВидЧаса,
	              	|	ЦБР_ЗаданиеЭффективныеЧасы.ЭффективныеЧасы КАК Часы
	              	|ИЗ
	              	|	Документ.ЦБР_Задание.ЧасыЗП КАК ЦБР_ЗаданиеЭффективныеЧасы
	              	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЦБР_Задание КАК ЦБР_Задание
	              	|		ПО ЦБР_ЗаданиеЭффективныеЧасы.Ссылка = ЦБР_Задание.Ссылка
	              	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.cbr_РеализацияТоваровУслугУПР КАК РеализацияТоваровУслуг
	              	|		ПО ЦБР_ЗаданиеЭффективныеЧасы.Реализация = РеализацияТоваровУслуг.Ссылка
	              	|ГДЕ
	              	|	ЦБР_ЗаданиеЭффективныеЧасы.Ссылка = &Ссылка
	              	|	И НЕ ЦБР_ЗаданиеЭффективныеЧасы.Реализация = ЗНАЧЕНИЕ(Документ.cbr_РеализацияТоваровУслугУПР.ПустаяСсылка)";
	
	Возврат ТекстЗапроса;
	
КонецФункции     

Функция ТекстЗапроса_ЦБР_КоличествоЧасовСотрудниковПоЗадачам()

	ТекстЗапроса =	"ВЫБРАТЬ
	              	|	ЦБР_ЗаданиеЭффективныеЧасы.ПериодЗП КАК Период,
	              	|	ЦБР_Задание.Ссылка КАК Регистратор,
	              	|	ЦБР_ЗаданиеЭффективныеЧасы.ВидЧаса КАК ВидЧаса,
	              	|	ЦБР_ЗаданиеЭффективныеЧасы.ЭффективныеЧасы КАК Часы,
	              	|	ЦБР_Задание.СсылкаНаЗадачу КАК СсылкаНаЗадачу,
	              	|	ЦБР_ЗаданиеЭффективныеЧасы.Исполнитель КАК Исполнитель
	              	|ИЗ
	              	|	Документ.ЦБР_Задание.ЧасыЗП КАК ЦБР_ЗаданиеЭффективныеЧасы
	              	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЦБР_Задание КАК ЦБР_Задание
	              	|		ПО ЦБР_ЗаданиеЭффективныеЧасы.Ссылка = ЦБР_Задание.Ссылка
	              	|ГДЕ
	              	|	ЦБР_ЗаданиеЭффективныеЧасы.Ссылка = &Ссылка";
	

	Возврат ТекстЗапроса;
	
КонецФункции  

Функция ТекстЗапросаЦБР_СогласованоЗакрытоЧасов()
	
	ТекстЗапроса =	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              	|	ЦБР_Задание.Ссылка КАК Регистратор,
	              	|	ЦБР_Задание.Постановщик КАК Постановщик,
	              	|	ЦБР_Задание.Исполнитель КАК Исполнитель,
	              	|	ЦБР_Задание.ЧасыСогласованы КАК ЧасыСогласованы,
	              	|	ЦБР_Задание.Подразделение КАК ПодразделениеИсполнителя,
	              	|	ЦБР_Задание.Постановщик.Подразделение КАК ПодразделениеПостановщика,
	              	|	ЦБР_Задание.СсылкаНаЗадачу КАК Задача,
	              	|	ЦБР_Задание.Дата КАК Дата,
	              	|	ЦБР_Задание.ТипОценкиЗадачи КАК ТипОценкиЗадачи,
	              	|	ЦБР_Задание.ТрудозатратыПлан КАК ТрудозатратыПлан,
	              	|	ЦБР_Задание.ТрудозатратыФакт КАК ТрудозатратыФакт,
	              	|	ЦБР_Задание.ТрудозатратыПланСтарый КАК ТрудозатратыПланСтарый,
	              	|	ЦБР_Задание.ВидЧаса КАК ВидЧаса
	              	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	              	|ИЗ
	              	|	Документ.ЦБР_Задание КАК ЦБР_Задание
	              	|ГДЕ
	              	|	ЦБР_Задание.Ссылка = &Ссылка
	              	|;
	              	|
	              	|////////////////////////////////////////////////////////////////////////////////
	              	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              	|	ЦБР_ЗаданиеЭффективныеЧасы.ПериодЗП КАК Период,
	              	|	ЦБР_ЗаданиеЭффективныеЧасы.Ссылка КАК Регистратор,
	              	|	ВТ_ДанныеДокумента.ПодразделениеИсполнителя КАК ПодразделениеИсполнителя,
	              	|	ВТ_ДанныеДокумента.ПодразделениеПостановщика КАК ПодразделениеПостановщика,
	              	|	ВТ_ДанныеДокумента.Задача КАК Задача,
	              	|	ЦБР_ЗаданиеЭффективныеЧасы.Исполнитель КАК Исполнитель,
	              	|	ВТ_ДанныеДокумента.Постановщик КАК Постановщик,
	              	|	ЦБР_ЗаданиеЭффективныеЧасы.ВидЧаса КАК ВидЧаса,
	              	|	ЦБР_ЗаданиеЭффективныеЧасы.Реализация КАК Реализация,
	              	|	ЦБР_ЗаданиеЭффективныеЧасы.ЭффективныеЧасы КАК Согласовано,
	              	|	ВЫБОР
	              	|		КОГДА ЦБР_ЗаданиеЭффективныеЧасы.ЗаСчетКомпании
	              	|			ТОГДА ЦБР_ЗаданиеЭффективныеЧасы.ЭффективныеЧасы
	              	|		КОГДА ЦБР_ЗаданиеЭффективныеЧасы.Зачтено
	              	|			ТОГДА ЦБР_ЗаданиеЭффективныеЧасы.ЭффективныеЧасы
	              	|		КОГДА ЦБР_ЗаданиеЭффективныеЧасы.ВидЧаса = ЗНАЧЕНИЕ(Перечисление.ЦБР_ВидыЧасовПоЗадачам.Демо)
	              	|			ТОГДА ЦБР_ЗаданиеЭффективныеЧасы.ЭффективныеЧасы
	              	|		КОГДА ЦБР_ЗаданиеЭффективныеЧасы.Реализация = ЗНАЧЕНИЕ(Документ.cbr_РеализацияТоваровУслугУПР.ПустаяСсылка)
	              	|			ТОГДА 0
	              	|		ИНАЧЕ ЦБР_ЗаданиеЭффективныеЧасы.ЭффективныеЧасы
	              	|	КОНЕЦ КАК Закрыто,
	              	|	ВЫБОР
	              	|		КОГДА ЦБР_ЗаданиеЭффективныеЧасы.ЗаСчетКомпании
	              	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЦБР_СтатусыЗадачиБезРеализации.ЗаСчетКомпании)
	              	|		КОГДА ЦБР_ЗаданиеЭффективныеЧасы.Зачтено
	              	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЦБР_СтатусыЗадачиБезРеализации.ПограничнаяЗадача)
	              	|		КОГДА ЦБР_ЗаданиеЭффективныеЧасы.ВидЧаса = ЗНАЧЕНИЕ(Перечисление.ЦБР_ВидыЧасовПоЗадачам.Демо)
	              	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЦБР_СтатусыЗадачиБезРеализации.Демо)
	              	|		КОГДА ЦБР_ЗаданиеЭффективныеЧасы.Реализация = ЗНАЧЕНИЕ(Документ.cbr_РеализацияТоваровУслугУПР.ПустаяСсылка)
	              	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ЦБР_СтатусыЗадачиБезРеализации.НетРеализации)
	              	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ЦБР_СтатусыЗадачиБезРеализации.ПустаяСсылка)
	              	|	КОНЕЦ КАК СтатусЗадачиБезРеализации,
	              	|	0 КАК Выполнено
	              	|ИЗ
	              	|	Документ.ЦБР_Задание.ЧасыЗП КАК ЦБР_ЗаданиеЭффективныеЧасы,
	              	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	              	|ГДЕ
	              	|	ЦБР_ЗаданиеЭффективныеЧасы.Ссылка = &Ссылка
	              	|
	              	|ОБЪЕДИНИТЬ ВСЕ
	              	|
	              	|ВЫБРАТЬ
	              	|	ЦБР_ЗаданиеЭффективныеЧасы.Дата,
	              	|	ВТ_ДанныеДокумента.Регистратор,
	              	|	ВТ_ДанныеДокумента.ПодразделениеИсполнителя,
	              	|	ВТ_ДанныеДокумента.ПодразделениеПостановщика,
	              	|	ВТ_ДанныеДокумента.Задача,
	              	|	ЦБР_ЗаданиеЭффективныеЧасы.Исполнитель,
	              	|	ВТ_ДанныеДокумента.Постановщик,
	              	|	ЦБР_ЗаданиеЭффективныеЧасы.ВидЧаса,
	              	|	ЗНАЧЕНИЕ(Документ.cbr_РеализацияТоваровУслугУПР.ПустаяСсылка),
	              	|	0,
	              	|	0,
	              	|	ЗНАЧЕНИЕ(Перечисление.ЦБР_СтатусыЗадачиБезРеализации.ПустаяСсылка),
	              	|	ЦБР_ЗаданиеЭффективныеЧасы.ЭффективныеЧасы
	              	|ИЗ
	              	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	              	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЦБР_Задание.ЭффективныеЧасы КАК ЦБР_ЗаданиеЭффективныеЧасы
	              	|		ПО ВТ_ДанныеДокумента.Регистратор = ЦБР_ЗаданиеЭффективныеЧасы.Ссылка
	              	|ГДЕ
	              	|	ЦБР_ЗаданиеЭффективныеЧасы.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЦБР_Часы()
	
	//ТекстЗапроса =	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//              	|	ЦБР_Часы.СсылкаНаЗадачу КАК СсылкаНаЗадачу,
	//              	|	ЦБР_Часы.Исполнитель КАК Исполнитель,
	//              	|	ЦБР_Часы.ВидЧаса КАК ВидЧаса,
	//              	|	ЦБР_Часы.ПериодЗП КАК ПериодЗП,
	//              	|	ЦБР_Часы.Реализация КАК Реализация,
	//              	|	ЦБР_Часы.ЗаСчетКомпании КАК ЗаСчетКомпании,
	//              	|	ЦБР_Часы.ЭффективныеЧасы КАК ЭффективныеЧасы
	//              	|ПОМЕСТИТЬ ВТ_Регистр
	//              	|ИЗ
	//              	|	РегистрСведений.ЦБР_Часы КАК ЦБР_Часы
	//              	|ГДЕ
	//              	|	ЦБР_Часы.СсылкаНаЗадачу = &СсылкаНаЗадачу
	//              	|	И ЦБР_Часы.Исполнитель = &Исполнитель
	//              	|	И ЦБР_Часы.ВидЧаса = &ВидЧаса
	//              	|;
	//              	|
	//              	|////////////////////////////////////////////////////////////////////////////////
	//              	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//              	|	СУММА(ЦБР_ЗаданиеЭффективныеЧасы.ЭффективныеЧасы) КАК ЭффективныеЧасы,
	//              	|	ЦБР_ЗаданиеЭффективныеЧасы.Ссылка.СсылкаНаЗадачу КАК СсылкаНаЗадачу,
	//              	|	ЦБР_ЗаданиеЭффективныеЧасы.Ссылка.ВидЧаса КАК ВидЧаса,
	//              	|	ЦБР_ЗаданиеЭффективныеЧасы.Ссылка.Исполнитель КАК Исполнитель
	//              	|ПОМЕСТИТЬ ВТ_Часы
	//              	|ИЗ
	//              	|	Документ.ЦБР_Задание.ЭффективныеЧасы КАК ЦБР_ЗаданиеЭффективныеЧасы
	//              	|ГДЕ
	//              	|	ЦБР_ЗаданиеЭффективныеЧасы.Ссылка.СсылкаНаЗадачу = &СсылкаНаЗадачу
	//              	|	И ЦБР_ЗаданиеЭффективныеЧасы.Ссылка.ВидЧаса = &ВидЧаса
	//              	|	И ЦБР_ЗаданиеЭффективныеЧасы.Исполнитель = &Исполнитель
	//              	|
	//              	|СГРУППИРОВАТЬ ПО
	//              	|	ЦБР_ЗаданиеЭффективныеЧасы.Ссылка.СсылкаНаЗадачу,
	//              	|	ЦБР_ЗаданиеЭффективныеЧасы.Ссылка.ВидЧаса,
	//              	|	ЦБР_ЗаданиеЭффективныеЧасы.Ссылка.Исполнитель
	//              	|;
	//              	|
	//              	|////////////////////////////////////////////////////////////////////////////////
	//              	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//              	|	ВТ_Регистр.СсылкаНаЗадачу КАК СсылкаНаЗадачу,
	//              	|	ВТ_Регистр.Исполнитель КАК Исполнитель,
	//              	|	ВТ_Регистр.ВидЧаса КАК ВидЧаса,
	//              	|	СУММА(ВТ_Регистр.ЭффективныеЧасы) КАК ЭффективныеЧасы
	//              	|ПОМЕСТИТЬ ВТ_РегистрИтог
	//              	|ИЗ
	//              	|	ВТ_Регистр КАК ВТ_Регистр
	//              	|
	//              	|СГРУППИРОВАТЬ ПО
	//              	|	ВТ_Регистр.СсылкаНаЗадачу,
	//              	|	ВТ_Регистр.Исполнитель,
	//              	|	ВТ_Регистр.ВидЧаса
	//              	|;
	//              	|
	//              	|////////////////////////////////////////////////////////////////////////////////
	//              	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//              	|	ВТ_Часы.СсылкаНаЗадачу КАК СсылкаНаЗадачу,
	//              	|	ВТ_Часы.Исполнитель КАК Исполнитель,
	//              	|	ВТ_Часы.ВидЧаса КАК ВидЧаса,
	//              	|	ВТ_Часы.ЭффективныеЧасы КАК ЭффективныеЧасы,
	//              	|	&ПериодЗП КАК ПериодЗП
	//              	|ПОМЕСТИТЬ ВТ_НераспределенныеЧасы
	//              	|ИЗ
	//              	|	ВТ_Часы КАК ВТ_Часы
	//              	|
	//              	|ОБЪЕДИНИТЬ ВСЕ
	//              	|
	//              	|ВЫБРАТЬ
	//              	|	ВТ_РегистрИтог.СсылкаНаЗадачу,
	//              	|	ВТ_РегистрИтог.Исполнитель,
	//              	|	ВТ_РегистрИтог.ВидЧаса,
	//              	|	-ВТ_РегистрИтог.ЭффективныеЧасы,
	//              	|	&ПериодЗП
	//              	|ИЗ
	//              	|	ВТ_РегистрИтог КАК ВТ_РегистрИтог
	//              	|
	//              	|ОБЪЕДИНИТЬ ВСЕ
	//              	|
	//              	|ВЫБРАТЬ
	//              	|	ВТ_Регистр.СсылкаНаЗадачу,
	//              	|	ВТ_Регистр.Исполнитель,
	//              	|	ВТ_Регистр.ВидЧаса,
	//              	|	ВТ_Регистр.ЭффективныеЧасы,
	//              	|	ВТ_Регистр.ПериодЗП
	//              	|ИЗ
	//              	|	ВТ_Регистр КАК ВТ_Регистр
	//              	|ГДЕ
	//              	|	НЕ ВТ_Регистр.ЗаСчетКомпании
	//              	|	И ВТ_Регистр.Реализация = &РеализацияПустая
	//              	|;
	//              	|
	//              	|////////////////////////////////////////////////////////////////////////////////
	//              	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//              	|	ВТ_НераспределенныеЧасы.СсылкаНаЗадачу КАК СсылкаНаЗадачу,
	//              	|	ВТ_НераспределенныеЧасы.Исполнитель КАК Исполнитель,
	//              	|	ВТ_НераспределенныеЧасы.ВидЧаса КАК ВидЧаса,
	//              	|	СУММА(ВТ_НераспределенныеЧасы.ЭффективныеЧасы) КАК ЭффективныеЧасы,
	//              	|	ВТ_НераспределенныеЧасы.ПериодЗП КАК ПериодЗП
	//              	|ИЗ
	//              	|	ВТ_НераспределенныеЧасы КАК ВТ_НераспределенныеЧасы
	//              	|
	//              	|СГРУППИРОВАТЬ ПО
	//              	|	ВТ_НераспределенныеЧасы.СсылкаНаЗадачу,
	//              	|	ВТ_НераспределенныеЧасы.Исполнитель,
	//              	|	ВТ_НераспределенныеЧасы.ВидЧаса,
	//              	|	ВТ_НераспределенныеЧасы.ПериодЗП";
	//
	//Возврат ТекстЗапроса;
	
КонецФункции

Процедура ЗаписатьДанныеЗанятостьПоДням()
	
	НаборЗаписей = РегистрыСведений.ЦБР_ЗанятостьПоДням.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Задание.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	ДатаНачала = ?(ЗначениеЗаполнено(ДатаНачалоФакт), ДатаНачалоФакт,НачалоДня(ТекущаяДатаСеанса()) + 33*3600);
	ДатаОкончания = ЦБР_ЗадачиЗаданияВызовСервера.РассчитатьОкончаниеПериода(ДатаНачала, ТрудозатратыПлан);
	ГрафикРаботы = ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьГрафикРаботы();
	РабочиеДаты = ЦБР_ЗадачиЗаданияВызовСервера.СформироватьТаблицуРабочегоВремени(ГрафикРаботы, ДатаНачала, ДатаОкончания); 
	
	ДанныеЗаполнения = РегистрыСведений.ЦБР_ЗанятостьПоДням.ПолучитьСтруктуруДляЗаписи();
	ДанныеЗаполнения.Задание = Ссылка;
	ДанныеЗаполнения.Постановщик = Постановщик;
	ДанныеЗаполнения.ПодразделениеПостановщика = Постановщик.Подразделение;
	ДанныеЗаполнения.Исполнитель = Исполнитель;
	ДанныеЗаполнения.ПодразделениеИсполнителя = Исполнитель.Подразделение;
	
	Для Каждого Стр Из РабочиеДаты Цикл 
		Стр.ДатаНачала = НачалоДня(Стр.ДатаНачала);
	КонецЦикла;
	
	РабочиеДаты.Свернуть("ДатаНачала", "Длительность");
	
	Для Каждого Стр Из РабочиеДаты Цикл
		ДанныеЗаполнения.Дата = Стр.ДатаНачала;	
		ДанныеЗаполнения.КоличествоЧасов = Стр.Длительность/3600;
		РегистрыСведений.ЦБР_ЗанятостьПоДням.СделатьЗаписьВРегистр(ДанныеЗаполнения);
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьЗапланированныеДействияИсполнителя(Исполнитель, ЗаданиеСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦБР_ЗаписиРабочегоКалендаря.Ссылка КАК Ссылка,
	|	ЦБР_ЗаписиРабочегоКалендаря.Пользователь КАК Пользователь
	|ИЗ
	|	Справочник.ЦБР_ЗаписиРабочегоКалендаря КАК ЦБР_ЗаписиРабочегоКалендаря
	|ГДЕ
	|	ЦБР_ЗаписиРабочегоКалендаря.ЗаданиеСсылка = &ЗаданиеСсылка
	|	И ЦБР_ЗаписиРабочегоКалендаря.Пользователь = &Пользователь
	|	И ЦБР_ЗаписиРабочегоКалендаря.Статус В (&Статус)
	|	И НЕ ЦБР_ЗаписиРабочегоКалендаря.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Пользователь", Исполнитель);
	Запрос.УстановитьПараметр("ЗаданиеСсылка", ЗаданиеСсылка); 
	
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.ЦБР_СтатусЗаписиКалендаря.Начал);
	МассивСтатусов.Добавить(Перечисления.ЦБР_СтатусЗаписиКалендаря.Новый);
	Запрос.УстановитьПараметр("Статус", МассивСтатусов);  
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции 

Процедура ЗакрытьЗапланированныеСобытияВКалендаре()
	
	Если ЗначениеЗаполнено(Исполнитель) Тогда 
		ТекущийСтатусЗадания = 	ЦБР_СтатусыОбъектовПолныеПрава.ПолучитьАктуальныйСтатусЗаданияПользователя(СсылкаНаСтруктуру, Исполнитель);
		Если ТекущийСтатусЗадания = Перечисления.ЦБР_Состояние.Выполнен Тогда    
			ТЗСписокНазавершенныхСобытийКалендаря = ПолучитьЗапланированныеДействияИсполнителя(Исполнитель, Ссылка);
			Для Каждого СобытиеПоЗаданию Из ТЗСписокНазавершенныхСобытийКалендаря Цикл
				
				РаботаСРабочимКалендаремСервер.УстановитьПометкуУдаления(
								СобытиеПоЗаданию.Событие,
								Истина,
								"Отменено: Задание выполнено.");
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнитьСтруктуру()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦБР_СтруктураЗадач.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ПредыдущееЗадание
		|ИЗ
		|	Справочник.ЦБР_СтруктураЗадач КАК ЦБР_СтруктураЗадач
		|ГДЕ
		|	ЦБР_СтруктураЗадач.СсылкаНаЗадание = &ПредыдущееЗадание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦБР_СтруктураЗадач.Ссылка КАК Ссылка,
		|	ВТ_ПредыдущееЗадание.Ссылка КАК Родитель
		|ПОМЕСТИТЬ ВТ_Итоговая
		|ИЗ
		|	Справочник.ЦБР_СтруктураЗадач КАК ЦБР_СтруктураЗадач,
		|	ВТ_ПредыдущееЗадание КАК ВТ_ПредыдущееЗадание
		|ГДЕ
		|	ЦБР_СтруктураЗадач.СсылкаНаЗадание <> &СсылкаНаЗадание
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЦБР_СтруктураЗадач.Ссылка,
		|	ВТ_ПредыдущееЗадание.Ссылка
		|ИЗ
		|	ВТ_ПредыдущееЗадание КАК ВТ_ПредыдущееЗадание
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦБР_СтруктураЗадач КАК ЦБР_СтруктураЗадач
		|		ПО ВТ_ПредыдущееЗадание.Ссылка = ЦБР_СтруктураЗадач.Ссылка
		|ГДЕ
		|	&ПредыдущееЗадание <> ЗНАЧЕНИЕ(Документ.ЦБР_Задание.ПустаяСсылка)
		|			И ЦБР_СтруктураЗадач.Родитель <> ВТ_ПредыдущееЗадание.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Итоговая.Ссылка КАК Ссылка,
		|	ВТ_Итоговая.Родитель КАК Родитель
		|ИЗ
		|	ВТ_Итоговая КАК ВТ_Итоговая
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Итоговая.Ссылка,
		|	ВТ_Итоговая.Родитель";
	
	Запрос.УстановитьПараметр("ПредыдущееЗадание", ПредыдущееЗадание);
	Запрос.УстановитьПараметр("СсылкаНаЗадание", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		объектСтруктура = СсылкаНаСтруктуру.ПолучитьОбъект();
		объектСтруктура.СсылкаНаЗадание  = Ссылка; 
		объектСтруктура.Записать();  
	КонецЦикла; 
	
КонецПроцедуры	

#КонецЕсли
